'use strict'
const TaxiFee = require('../main/main');

describe('taxi fee', function () {
    it('两公里以内，无等待时间',function () {
        var result = TaxiFee(0,1);
        var expected = "==========================\n" +
            "乘车明细\n" +
            "==========================\n" +
            "亲爱的乘客您好！\n" +
            "您本次乘车的里程数为1公里，\n" +
            "等待时间为0分钟，\n" +
            "乘车费用为6元。\n" +
            "祝您旅途愉快！\n" +
            "-------------------------------------------"
        expect(result).toEqual(expected);
    });
    it('八公里以内，无等待时间',function () {
        var result = TaxiFee(0,3);
        var expected = "==========================\n" +
            "乘车明细\n" +
            "==========================\n" +
            "亲爱的乘客您好！\n" +
            "您本次乘车的里程数为3公里，\n" +
            "等待时间为0分钟，\n" +
            "乘车费用为7元。\n" +
            "祝您旅途愉快！\n" +
            "-------------------------------------------"
        expect(result).toEqual(expected);
    });
    it('八公里以外，无等待时间',function () {
        var result = TaxiFee(0,10);
        var expected = "==========================\n" +
            "乘车明细\n" +
            "==========================\n" +
            "亲爱的乘客您好！\n" +
            "您本次乘车的里程数为10公里，\n" +
            "等待时间为0分钟，\n" +
            "乘车费用为14元。\n" +
            "祝您旅途愉快！\n" +
            "-------------------------------------------"
        expect(result).toEqual(expected);
    });
    it('八公里以外，有等待时间',function () {
        var result = TaxiFee(25,10);
        var expected = "==========================\n" +
            "乘车明细\n" +
            "==========================\n" +
            "亲爱的乘客您好！\n" +
            "您本次乘车的里程数为10公里，\n" +
            "等待时间为25分钟，\n" +
            "乘车费用为20元。\n" +
            "祝您旅途愉快！\n" +
            "-------------------------------------------"
        expect(result).toEqual(expected);
    });
});
